# 17.6 Специальная переменная __name__

#import new_python
#
# if __name__ == '__main__':
#     print('Инициализация исполняемого файла')
#     new_python.func()
#
# '''
# Если функция достаточно простая то вместо отдельного
# обьявления можно использовать lambda, главное помнить
# про читаемость кода и пайтоник вэй.
#
# Если мы хотим применить какую нибудь функцию к каждому
# итерируемому объекту, то для этого используется map.
#
# Для филтрации какого либо значения функции используется
# функция filter.
#
# Для чистоты кода используется if __name__ == '__main__' .
# '''